//
//  DataStore.swift
//  Wordle
//
//  Created by Сергей Иванов on 29.03.2022.
//

import Foundation

class DataStore {
    static let shared = DataStore()
    
    let fiveLetterCountries = [
        "АЛЖИР", "БЕЛИЗ", "БЕНИН", "БУТАН", "ГАБОН", "ГАИТИ",
        "ДАНИЯ", "ИНДИЯ", "ЙЕМЕН", "КАТАР", "КЕНИЯ", "ЛИВАН",
        "ЛИВИЯ", "ЛИТВА", "НАУРУ", "НЕПАЛ", "НИГЕР", "ПАЛАУ",
        "ПАПУА", "САМОА", "СИРИЯ", "СУДАН", "ТОНГА", "ТУНИС",
        "ФИДЖИ", "ЧЕХИЯ"
    ]
    
    let fourLetterCountries = [
        "ГАНА", "ИРАК", "ИРАН", "КИПР", "КНДР", "КУБА",
        "ЛАОС", "МАЛИ", "ОМАН", "ПЕРУ", "ТОГО", "ЧИЛИ"
    ]
    
    let letters = [
        "Й", "Ц", "У", "К", "Е", "Н", "Г", "Ш", "Щ", "З", "Х", "Ъ",
        "Ф", "Ы", "В", "А", "П", "Р", "О", "Л", "Д", "Ж", "Э",
        "Я", "Ч", "С", "М", "И", "Т", "Ь", "Б", "Ю"
    ]
    private init() {}
}
